Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: ཟླ་བའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལས་ཤིན་དུ་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྤྱི་གཙུག་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ངེས་པའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་
en: Moreover, Subhūti, the Great Vehicle of bodhisattva great beings comprises the following [meditative stabilities]: (1) the meditative stability named heroic valor, (2) the meditative stability named precious seal, (3) the meditative stability named lion’s play, (4) the meditative stability named beautiful moon, (5) the meditative stability named crest of the moon’s victory banner, (6) the meditative stability named surpassing all phenomena, (7) the meditative stability named seal of all phenomena, (8) the meditative stability named surveying the crown pinnacle, (9) the meditative stability named certainty in the realm of phenomena, (10) the meditative stability named crest of certainty’s victory banner, (11) the meditative stability named vajra, (12) the meditative stability named seal of entry into all phenomena, (13) the meditative stability named consecrated as a king of meditative stabilities, (14) the meditative stability named diffusion of light rays, (15) the meditative stability named array of power, (16) the meditative stability named sublimation [of all phenomena], (17) the meditative stability named engaging with certainty in lexical explanations, (18) the meditative stability named entry into designations, (19) the meditative stability named observation of spatial directions, (20) the meditative stability named receiving the seal, (21) the meditative stability named unimpaired, (22) the meditative stability named oceanic seal gathering all phenomena, (23) the meditative stability named permeation of space, (24) the meditative stability named vajra maṇḍala, (25) the meditative stability named shoulder ornament of the victory banner’s crest, (26) the meditative stability named crest of power, (27) the meditative stability named pursuit of the stream, (28) the meditative stability named yawning lion, (29) the meditative stability named out of order, (30) the meditative stability named repudiation of mental afflictions, (31) themeditative stability named illumination, (32) the meditative stability named unseeking, (33) the meditative stability named no fixed abode, (34) the meditative stability named free from mentation, (35) the meditative stability named taintless lamp, (36) the meditative stability named boundless light, (37) the meditative stability named illuminator, (38) the meditative stability named total illumination, (39) the meditative stability named pure sanctuary, (40) the meditative stability named immaculate light, (41) the meditative stability named bringer of joy, (42) the meditative stability named lightning lamp, (43) the meditative stability named inexhaustible, (44) the meditative stability named unvanquished, (45) the meditative stability named majestic, (46) the meditative stability named free from extinction, (47) the meditative stability named unmoving, (48) the meditative stability named imperishable, (49) the meditative stability named lamp of the sun, (50) the meditative stability named immaculate moon, (51) the meditative stability named lamp of wisdom, (52) the meditative stability named pure appearance, (53) the meditative stability named illuminating, (54) the meditative stability named engaging in performance, (55) the meditative stability named crest of wisdom, (56) the meditative stability named vajra-like, (57) the meditative stability named stability of mind, (58) the meditative stability named observing everything, (59) the meditative stability named consecrated, (60) the meditative stability named jewel cusp, (61) the meditative stability named seal of the Dharma, (62) the meditative stability named sameness of all phenomena, (63) the meditative stability named renunciation of delight, (64) the meditative stability named sublimation of phenomena, (65) the meditative stability named dispersal, (66) the meditative stability named distinguishing the terms associated with all phenomena, (67) the meditative stability named establishing the sameness of letters, (68) the meditative stability named devoid of letters, (69) the meditative stability named eradication of referents, (70) the meditative stability named unmodified, (71) the meditative stability named no aspect, (72) the meditative stability named ascertainment of names, (73) the meditative stability named roaming, (74) the meditative stability named devoid of darkness, (75) the meditative stability named engaging in conduct, (76) the meditative stability named unwavering, (77) the meditative stability named transcendence of the range, (78) the meditative stability named accumulation of all attributes, (79) the meditative stability named abiding without mentation, (80) the meditative stability named blossoming and vibrance of the flowers of virtue, (81) the meditative stability named endowed with the factors conducive to enlightenment, (82) the meditative stability named boundless eloquence, (83) the meditative stability named equal to the unequaled, (84) the meditative stability named transcending all phenomena, (85) the meditative stability named utterly devoid of delimitation, (86) the meditative stability named dispelling of doubt, (87) the meditative stability named without settled focus, (88) the meditative stability named single array, (89) the meditative stability named manifest attainment of aspects, (90) the meditative stability named unity, (91) the meditative stability named nonexclusion, (92) the meditative stability named comprehension of all bases of rebirth through realization, (93) the meditative stability named entrance to symbols and sounds, (94) the meditative stability named devoid of vocalic syllables, (95) the meditative stability named burning lamp, (96) the meditative stability named purification of defining characteristics, (97) the meditative stability named manifestly nonperceived, (98) the meditative stability named endowed with all finest aspects, (99) the meditative stability named absence of joy with respect to all happiness and suffering, (100) the meditative stability named inexhaustible cornucopia, (101) the meditative stability named dhāraṇī intelligence, (102) the meditative stability named complete elimination of right and wrong, (103) the meditative stability named calming of all deviations and obstacles, (104) the meditative stability named absence of disharmony, (105) the meditative stability named taintless light, (106) the meditative stability named endowed with the essence, (107) the meditative stability named taintless light of the full moon, (108) the meditative stability named lightning light, (109) the meditative stability named great ornament, (110) the meditative stability named illuminator of all worlds, (111) the meditative stability named sameness of meditative stability, (112) the meditative stability named taintless principle devoid of impurities, (113) the meditative stability named convergence in nonaffliction, (114) the meditative stability named convergence of all mental afflictions in nonaffliction, (115) the meditative stability named engaging in remaining without an objective support, (116) the meditative stability named abiding in the real nature without mentation, (117) the meditative stability named dispelling the misery of corporeality, (118) the meditative stability named obliterating defects of speech, transforming them as if into space, and (119) the meditative stability named unattached, liberated, and uncovered like space. “

source: དང་། རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཏིང་ངེ་འཛིན་གྱི་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དཔུང་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ངེས་པའི་ཚིག་ལ་གདོན་མི་ཟ་བར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཚིག་བླ་དགས་ལ་ཡང་དག་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱོགས་ལ་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཉམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱལ་མཚན་རྩེ་མོའི་དཔུང་རྒྱན་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དབང་པོའི་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱུན་གྱི་རྗེས་སུ་སོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེང་གེ་རྣམ་པར་བསྒྱིངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྣྲེལ་ཞི་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཉོན་མོངས་པ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཚོལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གནས་ལ་རྟེན་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དྲི་མ་མེད་པའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་བྱེད་པ་ཞེས་པའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་ཏུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དག་པ་དམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དགའ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གློག་གི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟད་མི་ཤེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མི་འཕམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟི་བརྗིད་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟད་པ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མི་གཡོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འཇིག་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཉི་མའི་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟླ་བ་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཤེས་རབ་སྒྲོན་མ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྣང་བ་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྣང་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བྱ་བ་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡེ་ཤེས་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡོ་རྗེ་ལྟ་བུ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཀུན་དུ་སྣང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རིན་ཆེན་མཐའ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་དམ་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དགའ་བ་སྤོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཀྱིས་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པར་འཐོར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ཀྱི་ཚིག་རབ་ཏུ་འབྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡི་གེ་མཉམ་པར་འགོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དམིགས་པ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འགྱུར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མིང་ངེས་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གནས་མེད་པར་སྤྱོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རབ་རིབ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྤྱོད་པ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཡོ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡུལ་ལས་རྒལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡོན་ཏན་ཐམས་ཅད་ཀྱི་ཚོགས་སུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སེམས་མེད་པར་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དགེ་བའི་མེ་ཏོག་རྒྱས་ཤིང་གསལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་ཡོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྤོབས་པ་མཐའ་ཡས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཆོས་ཐམས་ཅད་ལས་འདའ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡོངས་སུ་གཅོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནེམ་ནུར་རྣམ་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གནས་སུ་བྱ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཅིག་ཏུ་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པ་མངོན་པར་སྒྲུབ་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པ་གཅིག་ཏུ་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པ་འདོར་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྟོགས་པས་སྲིད་པའི་གཞི་ཐམས་ཅད་ཁོང་དུ་ཆུད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བརྡ་དང་སྒྲ་ལ་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྒྲ་དབྱངས་ཀྱི་ཡི་གེ་དང་བྲལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྒྲོན་མ་འབར་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མཚན་ཉིད་ཡོངས་སུ་སྦྱོང་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། མངོན་པར་དམིགས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། བདེ་བ་དང་སྡུག་བསྔལ་ཐམས་ཅད་ལ་མངོན་པར་དགའ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟད་མི་ཤེས་པའི་ཟ་མ་ཏོག་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་བློ་གྲོས་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཡང་དག་པ་དང་ལོག་པ་ཐམས་ཅད་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འགལ་བ་དང་འགོག་པ་ཐམས་ཅད་ཡང་དག་པར་ཞི་བར་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འཐུན་པ་དང་འགལ་བ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། འོད་དྲི་མ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། སྙིང་པོ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཟླ་བ་དྲི་མ་མེད་པར་རྒྱས་པའི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གློག་གི་འོད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྒྱན་ཆེན་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྣམ་པ་ཐམས་ཅད་དུ་འོད་བྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཏིང་ངེ་འཛིན་མཉམ་པ་ཉིད་ཅེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། རྡུལ་མེད་ཅིང་རྡུལ་དང་བྲལ་བའི་ཚུལ་དང་ལྡན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ཉོན་མོངས་པ་དང་བཅས་པ་ཐམས་ཅད་ཉོན་མོངས་པ་མེད་པར་ཡང་དག་པར་གཞོལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། གནས་དམིགས་སུ་མེད་པ་ལ་བརྩོན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། དེ་བཞིན་ཉིད་ལ་གནས་ཤིང་སེམས་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ལུས་ཀྱི་སྐྱོན་ཡང་དག་པར་སེལ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ངག་གི་སྐྱོན་རྣམ་པར་འཇིག་པས་ནམ་མཁའ་ལྟར་གྱུར་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་དང་། ནམ་མཁའ་ལྟར་ཆགས་པ་མེད་པས་རྣམ་པར་གྲོལ་ཞིང་གོས་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ། །དེ་ལ་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་ལ་སྤྱོད་པ་སྟེ།
en: In this regard, if you ask what is (1) the meditative stability named heroic valor, this meditative stability functions within the perceptual range of all meditative stabilities.

source: འདི་ནི་དཔའ་བར་འགྲོ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named heroic valor.

source: །དེ་ལ་རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེས་ཏིང་ངེ་འཛིན་ཐམས་ཅད་རྒྱས་བཏབ་པ་ལྟ་བུར་འགྱུར་བ་སྟེ།
en: If you ask what is (2) the meditative stability named precious seal, through this meditative stability all meditative stabilities are sealed.

source: འདི་ནི་རིན་ཆེན་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named precious seal.

source: །དེ་ལས་སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་རྩེ་བ་སྟེ།
en: If you ask what is (3) the meditative stability named lion’s play, abiding in that meditative stability, one plays with all meditative stabilities.

source: འདི་ནི་སེང་གེ་རྣམ་པར་རྩེ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named lion’s play.

source: །དེ་ལ་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་སྣང་བར་བྱེད་པ་སྟེ།
en: If you ask what is (4) the meditative stability named beautiful moon, abiding in that meditative stability, one illuminates all meditative stabilities.

source: འདི་ནི་ཟླ་བ་བཟང་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named beautiful moon.

source: །དེ་ལ་ཟླ་བའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ནི་ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་འཛིན་པ་སྟེ།
en: If you ask what is (5) the meditative stability named crest of the moon’s victory banner, this meditative stability upholds the victory banner of all meditative stabilities.

source: འདི་ནི་ཟླ་བའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named crest of the moon’s victory banner.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ལས་ཤིན་དུ་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱིས་མངོན་པར་འཕགས་པ་སྟེ།
en: If you ask what is (6) the meditative stability named surpassing all phenomena, abiding in that meditative stability, one becomes exalted over all meditative stabilities.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ལས་ཤིན་དུ་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named surpassing all phenomena. {

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་མི་འགྱུར་བའི་ཕྱག་རྒྱས་བཏབ་པ་སྟེ།
en: Dt.199} If you ask what is (7) the meditative stability named seal of all phenomena, abiding in that meditative stability, all phenomena are sealed with the unchanging seal.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named seal of all phenomena.

source: །དེ་ལ་སྤྱི་གཙུག་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྤྱི་གཙུག་རྣམ་པར་ལྟ་བ་སྟེ།
en: If you ask what is (8) the meditative stability named surveying the crown pinnacle, abiding in that meditative stability, one surveys the pinnacle of all meditative stabilities.

source: འདི་ནི་སྤྱི་གཙུག་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named surveying the crown pinnacle.

source: །དེ་ལ་ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཀྱི་དབྱིངས་སུ་རྟོགས་པར་འགྲོ་བ་སྟེ།
en: If you ask what is (9) the meditative stability named certainty in the realm of phenomena, abiding in that meditative stability, one moves toward understanding concerning the realm of phenomena.

source: འདི་ནི་ཆོས་ཀྱི་དབྱིངས་སུ་ངེས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named certainty in the realm of phenomena.

source: །དེ་ལ་ངེས་པའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་རྒྱལ་མཚན་ངེས་པ་འཛིན་པ་སྟེ།
en: If you ask what is (10) the meditative stability named crest of certainty’s victory banner, abiding in that meditative stability, one holds the victory banner indicative of certainty with respect to all meditative stabilities.

source: འདི་ནི་ངེས་པའི་རྒྱལ་མཚན་དཔལ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named crest of certainty’s victory banner.

source: །དེ་ལ་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་འཇིག་པར་མི་འགྱུར་བ་སྟེ།
en: If you ask what is (11) the meditative stability named vajra, abiding in that meditative stability, all meditative stabilities will not perish.

source: འདི་ནི་རྡོ་རྗེ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named vajra.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཆོས་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ལ་འཇུག་པ་སྟེ།
en: If you ask what is (12) the meditative stability named seal of entry into all phenomena, abiding in that meditative stability, one enters into the seal of all phenomena.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ལ་འཇུག་པའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named seal of entry into all phenomena.

source: །དེ་ལ་ཏིང་ངེ་འཛིན་ལ་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ལ་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་སྟེ།
en: If you ask what is (13) the meditative stability named consecrated as a king of meditative stabilities, abiding in that meditative stability, one is consecrated as a king of all meditative stabilities.

source: འདི་ནི་ཏིང་ངེ་འཛིན་ལ་རྒྱལ་པོ་ལྟར་རབ་ཏུ་གནས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named consecrated as a king of meditative stabilities.

source: །དེ་ལ་འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་སྟེ།
en: If you ask what is (14) the meditative stability named diffusion of light rays, abiding in that meditative stability, one diffuses the light rays of all meditative stabilities.

source: འདི་ནི་འོད་ཟེར་རབ་ཏུ་འགྱེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named diffusion of light rays.

source: །དེ་ལ་དཔུང་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་སྟོབས་རྣམ་པར་འགོད་པ་སྟེ།
en: If you ask what is (15) the meditative stability named array of power, abiding in that meditative stability, one arrays the power of all meditative stabilities.

source: འདི་ནི་དཔུང་རྣམ་པར་བཀོད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named array of power.

source: །དེ་ལ་ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཡང་དག་པར་འཕགས་པར་འགྱུར་བ་སྟེ།
en: If you ask what is (16) the meditative stability named sublimation, abiding in that meditative stability, one sublimates all meditative stabilities.

source: འདི་ནི་ཡང་དག་པར་འཕགས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named sublimation.

source: །དེ་ལ་ངེས་པའི་ཚིག་ལ་གདོན་མི་ཟ་བར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ངེས་པའི་ཚིག་བསྟན་པ་ལ་འཇུག་པ་སྟེ།
en: If you ask what is (17) the meditative stability named engaging with certainty in lexical explanations, abiding in that meditative stability, one engages in the exposition of the precise etymologies of all the meditative stabilities.

source: འདི་ནི་ངེས་པའི་ཚིག་ལ་གདོན་མི་ཟ་བར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named engaging with certainty in lexical explanations.

source: །དེ་ལ་ཚིག་བླ་དགས་ལ་ཡང་དག་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཚིག་བླ་དགས་ལ་འཇུག་པ་སྟེ།
en: If you ask what is (18) the meditative stability named entry into designations, abiding in that meditative stability, one enters into the designations of all the meditative stabilities.

source: འདི་ནི་ཚིག་བླ་དགས་ལ་ཡང་དག་པར་འཇུག་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named entry into designations.

source: །དེ་ལ་ཕྱོགས་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཕྱོགས་རྣམ་པར་ལྟ་བ་སྟེ།
en: If you ask what is (19) the meditative stability named observation of spatial directions, abiding in that meditative stability, one observes the spatial directions of all meditative stabilities.

source: འདི་ནི་ཕྱོགས་རྣམ་པར་ལྟ་བ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named observation of spatial directions.

source: །དེ་ལ་ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པ་སྟེ།
en: If you ask what is (20) the meditative stability named receiving the seal, abiding in that meditative stability, one receives the seal of all meditative stabilities.

source: འདི་ནི་ཕྱག་རྒྱ་ཡོངས་སུ་འཛིན་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named receiving the seal.

source: །དེ་ལ་ཉམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཉམ་པར་མི་འགྱུར་བ་སྟེ།
en: If you ask what is (21) the meditative stability named unimpaired, abiding in that meditative stability, one does not impair any of the meditative stabilities.

source: འདི་ནི་ཉམ་པ་མེད་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named unimpaired.

source: །དེ་ལ་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་འདུ་ཞིང་ཁོངས་སུ་ཆུད་པར་འདོད་པ་སྟེ།
en: If you ask what is (22) the meditative stability named oceanic seal gathering all phenomena, abiding in that meditative stability, one seeks to gather and comprehend all meditative stabilities.

source: འདི་ནི་ཆོས་ཐམས་ཅད་ཡང་དག་པར་འདུ་བ་རྒྱ་མཚོའི་ཕྱག་རྒྱ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named oceanic seal gathering all phenomena.

source: །དེ་ལ་ནམ་མཁའ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གང་ཞེ་ན། ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཤིང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ནམ་མཁའ་རྒྱས་པར་འགེངས་པ་སྟེ།
en: If you ask what is (23) the meditative stability named permeation of space, abiding in that meditative stability, one permeates the space of all meditative stabilities.

source: འདི་ནི་ནམ་མཁའ་རྒྱས་པར་འགེངས་པ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་ཏོ།
en: This is the meditative stability named permeation of space.
